STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp213axx_cm33.h
/**
  * @brief Universal Synchronous Asynchronous Receiver Transmitter
  */
/* c7amba_sci3_v3.0 */
typedef struct
{
  __IO uint32_t CR1;             /*!< USART Control register 1                    Address offset: 0x000 */
  __IO uint32_t CR2;             /*!< USART Control register 2                    Address offset: 0x004 */
  __IO uint32_t CR3;             /*!< USART Control register 3                    Address offset: 0x008 */
  __IO uint32_t BRR;             /*!< USART Baud rate register                    Address offset: 0x00C */
  __IO uint32_t GTPR;            /*!< USART Guard time and prescaler register     Address offset: 0x010 */
  __IO uint32_t RTOR;            /*!< USART Receiver timeout register             Address offset: 0x014 */
  __IO uint32_t RQR;             /*!< USART Request register                      Address offset: 0x018 */
  __IO uint32_t ISR;             /*!< USART Interrupt and status register         Address offset: 0x01C */
  __IO uint32_t ICR;             /*!< USART Interrupt flag Clear register         Address offset: 0x020 */
  __IO uint32_t RDR;             /*!< USART Receive Data register                 Address offset: 0x024 */
  __IO uint32_t TDR;             /*!< USART Transmit Data register                Address offset: 0x028 */
  __IO uint32_t PRESC;           /*!< USART Prescaler register                    Address offset: 0x02C */
  __IO uint32_t AUTOCR;          /*!< USART Autonomous mode Control register      Address offset: 0x030 */
       uint32_t RESERVED0[238];  /*!< Reserved                                    Address offset: 0x034-0x3E8 */
  __IO uint32_t HWCFGR2;         /*!< USART Hardware Configuration register 2     Address offset: 0x3EC */
  __IO uint32_t HWCFGR1;         /*!< USART Hardware Configuration register 1     Address offset: 0x3F0 */
  __IO uint32_t VERR;            /*!< USART version register                      Address offset: 0x3F4 */
  __IO uint32_t IPIDR;           /*!< USART Identification register               Address offset: 0x3F8 */
  __IO uint32_t SIDR;            /*!< USART Size Identification register          Address offset: 0x3FC */
} USART_TypeDef;


/**
  * @brief USB_EHCI HOST Registers
  */
typedef struct
{
  __IO uint32_t HCCAPBASE;        /*!< Capability Register,                       Address offset: 0x00 */
  __IO uint32_t HCSPARAMS;        /*!< Structural Parameter Register              Address offset: 0x04 */
  __IO uint32_t HCCPARAMS;        /*!< Capability Parameter Register,             Address offset: 0x08 */
       uint32_t RESERVED1;        /*!< RESERVED1,                                 Address offset: 0x0C */
  __IO uint32_t USBCMD;           /*!< USB Command Register,                      Address offset: 0x10 */
  __IO uint32_t USBSTS;           /*!< USB Status Register,                       Address offset: 0x14 */
  __IO uint32_t USBINTR;          /*!< USB Interrupt Enable Register,             Address offset: 0x18 */
  __IO uint32_t FRINDEX;          /*!< USB Frame Index Register ,                 Address offset: 0x1C */
  __IO uint32_t CTRLDSSEGMENT;    /*!< Control Data Structure Selector Register,  Address offset: 0x20 */
  __IO uint32_t PERIODICLISTBASE; /*!< Periodic Frame List Base Address Register, Address offset: 0x24 */
  __IO uint32_t ASYNCLISTADDR;    /*!< Asynchronous List Address Register,        Address offset: 0x28 */
       uint32_t RESERVED2[9];     /*!< RESERVED2,                                 Address offset: 0x2C - 0x48 */
  __IO uint32_t CONFIGFLAG;       /*!< Configure Flag Register,                   Address offset: 0x50 */
  __IO uint32_t PORTSC[1];        /*!< Port Status and Control Register,          Address offset: 0x54 */
       uint32_t RESERVED3[15];    /*!< RESERVED3,                                 Address offset: 0x58 - 0x90 */
  __IO uint32_t INSNREG[7];       /*!< Implementation Register,                   Address offset: 0x94 - 0xAC */
} USBH_EHCI_TypeDef;

typedef struct
{
  /* Control and Status Registers */
  __IO uint32_t HCREVISION;           /*!< Host Controller Revision,             Address offset: 0x00 */
  __IO uint32_t HCCONTROL;            /*!< Host Controller Control,              Address offset: 0x04 */
  __IO uint32_t HCCOMMANDSTATUS;      /*!< Host Controller Command Status,       Address offset: 0x08 */
  __IO uint32_t HCINTERRUPTSTATUS;    /*!< Host Controller Interrupt Status,     Address offset: 0x0C */
  __IO uint32_t HCINTERRUPTENABLE;    /*!< Host Controller Interrupt Enable,     Address offset: 0x10 */
  /* Memory Pointers */
  __IO uint32_t HCHCCA;               /*!< Host Controller Communication Area,   Address offset: 0x18 */
  __IO uint32_t HCPERIODCURRENTED;    /*!< Current Isochronous or Interrupt ED,  Address offset: 0x1C */
  __IO uint32_t HCCONTROLHEADED;      /*!< Control Head ED,                      Address offset: 0x20 */
  __IO uint32_t HCCONTROLCURRENTED;   /*!< Control Current ED,                   Address offset: 0x24 */
  __IO uint32_t HCBULKHEADED;         /*!< Bulk Head ED,                         Address offset: 0x28 */
  __IO uint32_t HCBULKCURRENTED;      /*!< Bulk Current ED,                      Address offset: 0x2C */
  __IO uint32_t HCDONEHEAD;           /*!< Done Head,                            Address offset: 0x30 */
  /* Frame Counters */
  __IO uint32_t HCFMINTERVAL;         /*!< Frame Interval,                       Address offset: 0x34 */
  __IO uint32_t HCFMREMAINING;        /*!< Frame Remaining,                      Address offset: 0x38 */
  __IO uint32_t HCFMNUMBER;           /*!< Frame Number,                         Address offset: 0x3C */
  __IO uint32_t PERIODICSTART;        /*!< Periodic Start,                       Address offset: 0x40 */
  __IO uint32_t HCLSTHRESHOLD;        /*!< Low-Speed Threshold,                  Address offset: 0x44 */
  /* Root Hub Ports */
  __IO uint32_t HCRHDESCRIPTORA;      /*!< Root Hub Descriptor A,                Address offset: 0x48 */
  __IO uint32_t HCRHDESCRIPTORB;      /*!< Root Hub Descriptor B,                Address offset: 0x4C */
  __IO uint32_t HCRHSTATUS;           /*!< Root Hub Status,                      Address offset: 0x50 */
  __IO uint32_t HCRHPORTSTATUS0;      /*!< Root Hub Port Status (Port 1),          Address offset: 0x54 */
       uint32_t RESERVED[16];         /*!< Reserved,                             Address offset: 0x58 - 0x90 */
  __IO uint32_t INSNREG[2];           /*!< Implementation Registers,             Address offset: 0x94 - 0x9C */
} USBH_OHCI_TypeDef;

/**
  * @brief USB_OTG_Core_register
  */
typedef struct
{
  __IO uint32_t GOTGCTL;             /*!< USB_OTG Control and Status Register,       Address offset: 000h */
  __IO uint32_t GOTGINT;             /*!< USB_OTG Interrupt Register,                Address offset: 004h */
  __IO uint32_t GAHBCFG;             /*!< Core AHB Configuration Register,           Address offset: 008h */
  __IO uint32_t GUSBCFG;             /*!< Core USB Configuration Register,           Address offset: 00Ch */
  __IO uint32_t GRSTCTL;             /*!< Core Reset Register,                       Address offset: 010h */
  __IO uint32_t GINTSTS;             /*!< Core Interrupt Register,                   Address offset: 014h */
  __IO uint32_t GINTMSK;             /*!< Core Interrupt Mask Register,              Address offset: 018h */
  __IO uint32_t GRXSTSR;             /*!< Receive Sts Q Read Register,               Address offset: 01Ch */
  __IO uint32_t GRXSTSP;             /*!< Receive Sts Q Read & POP Register,         Address offset: 020h */
  __IO uint32_t GRXFSIZ;             /*!< Receive FIFO Size Register,                Address offset: 024h */
  __IO uint32_t DIEPTXF0_HNPTXFSIZ;  /*!< EP0 / Non Periodic Tx FIFO Size Register,  Address offset: 028h */
  __IO uint32_t HNPTXSTS;            /*!< Non Periodic Tx FIFO/Queue Sts reg,        Address offset: 02Ch */
  __IO uint32_t Reserved0[2];        /*!< Reserved,                                  Address offset: 030h */
  __IO uint32_t GCCFG;               /*!< General Purpose IO Register,               Address offset: 038h */
  __IO uint32_t CID;                 /*!< User ID Register,                          Address offset: 03Ch */
       uint32_t RESERVED1[5];        /*!< Reserved,                                  Address offset: 040h-050h */
  __IO uint32_t GLPMCFG;             /*!< LPM Register,                              Address offset: 054h */
  __IO uint32_t Reserved2[42];       /*!< Reserved,                                  Address offset: 058h-0FCh */
  __IO uint32_t HPTXFSIZ;            /*!< Host Periodic Tx FIFO Size Reg,            Address offset: 100h */
  __IO uint32_t DIEPTXF[0x08];       /*!< dev Periodic Transmit FIFO                 Address offset: 104h */
} USB_OTG_GlobalTypeDef;

/**
  * @brief USB_OTG_device_Registers
  */
typedef struct
{
  __IO uint32_t DCFG;                /*!< dev Configuration Register,   Address offset: 800h */
  __IO uint32_t DCTL;                /*!< dev Control Register,         Address offset: 804h */
  __IO uint32_t DSTS;                /*!< dev Status Register (RO),     Address offset: 808h */
       uint32_t Reserved23;          /*!< Reserved,                     Address offset: 80Ch */
  __IO uint32_t DIEPMSK;             /*!< dev IN Endpoint Mask,         Address offset: 810h */
  __IO uint32_t DOEPMSK;             /*!< dev OUT Endpoint Mask,        Address offset: 814h */
  __IO uint32_t DAINT;               /*!< dev All Endpoints Itr Reg,    Address offset: 818h */
  __IO uint32_t DAINTMSK;            /*!< dev All Endpoints Itr Mask,   Address offset: 81Ch */
       uint32_t RESERVED24[4];       /*!< Reserved,                     Address offset: 820-82Ch */
  __IO uint32_t DTHRCTL;             /*!< dev threshold,                Address offset: 830h */
  __IO uint32_t DIEPEMPMSK;          /*!< dev empty msk,                Address offset: 834h */
  __IO uint32_t DEACHINT;            /*!< dedicated EP interrupt,       Address offset: 838h */
  __IO uint32_t DEACHMSK;            /*!< dedicated EP msk,             Address offset: 83Ch */
       uint32_t Reserved25;               /*!< dedicated EP mask,            Address offset: 840h */
  __IO uint32_t DINEP1MSK;           /*!< dedicated EP mask,            Address offset: 844h */
       uint32_t Reserved26[15];          /*!< Reserved,                     Address offset: 844-87Ch */
  __IO uint32_t DOUTEP1MSK;          /*!< dedicated EP msk,             Address offset: 884h */
} USB_OTG_DeviceTypeDef;

/**
  * @brief USB_OTG_IN_Endpoint-Specific_Register
  */
typedef struct
{
  __IO uint32_t DIEPCTL;             /*!< dev IN Endpoint Control Register,          Address offset: 900h + (ep_num * 20h) + 00h */
  __IO uint32_t Reserved04;          /*!< Reserved,                                  Address offset: 900h + (ep_num * 20h) + 04h */
  __IO uint32_t DIEPINT;             /*!< dev IN Endpoint Itr Register,              Address offset: 900h + (ep_num * 20h) + 08h */
  __IO uint32_t Reserved0C;          /*!< Reserved,                                  Address offset: 900h + (ep_num * 20h) + 0Ch */
  __IO uint32_t DIEPTSIZ;            /*!< IN Endpoint Txfer Size Register,           Address offset: 900h + (ep_num * 20h) + 10h */
  __IO uint32_t DIEPDMA;             /*!< IN Endpoint DMA Address Register,          Address offset: 900h + (ep_num * 20h) + 14h */
  __IO uint32_t DTXFSTS;             /*!< IN Endpoint Tx FIFO Status Register,       Address offset: 900h + (ep_num * 20h) + 18h */
  __IO uint32_t Reserved18;          /*!< Reserved,                                  Address offset: 900h + (ep_num * 20h) + 1Ch */
} USB_OTG_INEndpointTypeDef;

/**
  * @brief USB_OTG_OUT_Endpoint-Specific_Registers
  */
typedef struct
{
  __IO uint32_t DOEPCTL;             /*!< dev OUT Endpoint Control Register,         Address offset: B00h + (ep_num * 20h) + 00h */
  __IO uint32_t Reserved04;          /*!< Reserved,                                  Address offset: B00h + (ep_num * 20h) + 04h */
  __IO uint32_t DOEPINT;             /*!< dev OUT Endpoint Itr Register,             Address offset: B00h + (ep_num * 20h) + 08h */
  __IO uint32_t Reserved0C;          /*!< Reserved,                                  Address offset: B00h + (ep_num * 20h) + 0Ch */
  __IO uint32_t DOEPTSIZ;            /*!< dev OUT Endpoint Txfer Size Register,      Address offset: B00h + (ep_num * 20h) + 10h */
  __IO uint32_t DOEPDMA;             /*!< dev OUT Endpoint DMA Address Register,     Address offset: B00h + (ep_num * 20h) + 14h */
  __IO uint32_t Reserved18[2];       /*!< Reserved,                                  Address offset: B00h + (ep_num * 20h) + 18h */
} USB_OTG_OUTEndpointTypeDef;

/**
  * @brief USB_OTG_Host_Mode_Register_Structures
  */
typedef struct
{
  __IO uint32_t HCFG;                 /*!< Host Configuration Register,                Address offset: 400h */
  __IO uint32_t HFIR;                 /*!< Host Frame Interval Register,               Address offset: 404h */
  __IO uint32_t HFNUM;                /*!< Host Frame Nbr/Frame Remaining,             Address offset: 408h */
       uint32_t Reserved4;            /*!< Reserved,                                   Address offset: 40Ch */
  __IO uint32_t HPTXSTS;              /*!< Host Periodic Tx FIFO/ Queue Status,        Address offset: 410h */
  __IO uint32_t HAINT;                /*!< Host All Channels Interrupt Register,       Address offset: 414h */
  __IO uint32_t HAINTMSK;             /*!< Host All Channels Interrupt Mask,           Address offset: 418h */
       uint32_t RESERVED5[9];         /*!< Reserved,                                   Address offset: 41C-43Ch */
  __IO uint32_t HPRT;                 /*!< OTG host port control and status register,  Address offset: 440h */
} USB_OTG_HostTypeDef;

/**
  * @brief USB_OTG_Host_Channel_Specific_Registers
  */
typedef struct
{
  __IO uint32_t HCCHAR;               /*!< Host Channel Characteristics Register,    Address offset: 500h */
  __IO uint32_t HCSPLT;               /*!< Host Channel Split Control Register,      Address offset: 504h */
  __IO uint32_t HCINT;                /*!< Host Channel Interrupt Register,          Address offset: 508h */
  __IO uint32_t HCINTMSK;             /*!< Host Channel Interrupt Mask Register,     Address offset: 50Ch */
  __IO uint32_t HCTSIZ;               /*!< Host Channel Transfer Size Register,      Address offset: 510h */
  __IO uint32_t HCDMA;                /*!< Host Channel DMA Address Register,        Address offset: 514h */
       uint32_t Reserved[2];          /*!< Reserved,                                 Address offset: 518h */
} USB_OTG_HostChannelTypeDef;

/**
  * @brief VREFBUF
  */
typedef struct
{
  __IO uint32_t CSR;         /*!< VREFBUF control and status register,         Address offset: 0x00 */
  __IO uint32_t CCR;         /*!< VREFBUF calibration and control register,    Address offset: 0x04 */
} VREFBUF_TypeDef;

