STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp213axx_cm33.h
#define BSEC_NS                             ((BSEC_TypeDef *) BSEC_BASE_NS)
#define IWDG1_NS                            ((IWDG_TypeDef *) IWDG1_BASE_NS)
#define IWDG2_NS                            ((IWDG_TypeDef *) IWDG2_BASE_NS)
#define IWDG3_NS                            ((IWDG_TypeDef *) IWDG3_BASE_NS)
#define IWDG4_NS                            ((IWDG_TypeDef *) IWDG4_BASE_NS)
#define WWDG1_NS                            ((WWDG_TypeDef *) WWDG1_BASE_NS)
#define VREFBUF_NS                          ((VREFBUF_TypeDef *) VREFBUF_BASE_NS)
#define DTS_NS                              ((DTS_TypeDef *) DTS_BASE_NS)
#define SERC_NS                             ((SERC_TypeDef *) SERC_BASE_NS)
#define HDP_NS                              ((HDP_TypeDef *) HDP_BASE_NS)

#define RCC_NS                              ((RCC_TypeDef *) RCC_BASE_NS)
#define PWR_NS                              ((PWR_TypeDef *) PWR_BASE_NS)
#define EXTI1_NS                            ((EXTI_TypeDef *) EXTI1_BASE_NS)
#define EXTI1_C1_NS                         ((EXTI_Core_TypeDef *) EXTI1_C1_BASE_NS)
#define EXTI1_C2_NS                         ((EXTI_Core_TypeDef *) EXTI1_C2_BASE_NS)
#define SYSCFG_NS                           ((SYSCFG_TypeDef *) SYSCFG_BASE_NS)
#define GPIOA_NS                            ((GPIO_TypeDef *) GPIOA_BASE_NS)
#define GPIOB_NS                            ((GPIO_TypeDef *) GPIOB_BASE_NS)
#define GPIOC_NS                            ((GPIO_TypeDef *) GPIOC_BASE_NS)
#define GPIOD_NS                            ((GPIO_TypeDef *) GPIOD_BASE_NS)
#define GPIOE_NS                            ((GPIO_TypeDef *) GPIOE_BASE_NS)
#define GPIOF_NS                            ((GPIO_TypeDef *) GPIOF_BASE_NS)
#define GPIOG_NS                            ((GPIO_TypeDef *) GPIOG_BASE_NS)
#define GPIOH_NS                            ((GPIO_TypeDef *) GPIOH_BASE_NS)
#define GPIOI_NS                            ((GPIO_TypeDef *) GPIOI_BASE_NS)

#define RTC_NS                              ((RTC_TypeDef *) RTC_BASE_NS)
#define TAMP_NS                             ((TAMP_TypeDef *) TAMP_BASE_NS)
#define SPI6_NS                             ((SPI_TypeDef *) SPI6_BASE_NS)
#define LPUART1_NS                          ((USART_TypeDef *) LPUART1_BASE_NS)
#define LPTIM3_NS                           ((LPTIM_TypeDef *) LPTIM3_BASE_NS)
#define LPTIM4_NS                           ((LPTIM_TypeDef *) LPTIM4_BASE_NS)
#define LPTIM5_NS                           ((LPTIM_TypeDef *) LPTIM5_BASE_NS)

#define GPIOZ_NS                            ((GPIO_TypeDef *) GPIOZ_BASE_NS)
#define ADF1_NS                             ((MDF_TypeDef *) ADF1_BASE_NS)
#define ADF1_Filter0_NS                     ((MDF_Filter_TypeDef*) ADF1_Filter0_BASE_NS)
#define EXTI2_NS                            ((EXTI_TypeDef *) EXTI2_BASE_NS)
#define EXTI2_C1_NS                         ((EXTI_Core_TypeDef *) EXTI2_C1_BASE_NS)
#define EXTI2_C2_NS                         ((EXTI_Core_TypeDef *) EXTI2_C2_BASE_NS)
#define EXTI2_C3_NS                         ((EXTI_Core_TypeDef *) EXTI2_C3_BASE_NS)
#define LTDC_NS                             ((LTDC_TypeDef *) LTDC_BASE_NS)
#define LTDC_Layer1_NS                      ((LTDC_Layer_TypeDef *) LTDC_Layer1_BASE_NS)
#define LTDC_Layer2_NS                      ((LTDC_Layer_TypeDef *) LTDC_Layer2_BASE_NS)
#define LTDC_Layer3_NS                      ((LTDC_Layer_TypeDef *) LTDC_Layer3_BASE_NS)
#define DCMIPP_NS                           ((DCMIPP_TypeDef *) DCMIPP_BASE_NS)
#define DDRC_NS                             ((DDRC_TypeDef *) DDRC_BASE_NS)
#define DDRDBG_NS                           ((DDRDBG_TypeDef *) DDRDBG_BASE_NS)
#define DDRPERFM_NS                         ((DDRPERFM_TypeDef *) DDRPERFM_BASE_NS)
#define STGENC_NS                           ((STGENC_TypeDef *) STGENC_BASE_NS)
#define STGENR_NS                           ((STGENR_TypeDef *) STGENR_BASE_NS)
#define FMC_Bank1_R_NS                      ((FMC_Bank1_TypeDef *) FMC_Bank1_R_BASE_NS)
#define FMC_Bank1E_R_NS                     ((FMC_Bank1E_TypeDef *) FMC_Bank1E_R_BASE_NS)
#define FMC_Bank3_R_NS                      ((FMC_Bank3_TypeDef *) FMC_Bank3_R_BASE_NS)
#define FMC_Common_R_NS                     ((FMC_Common_TypeDef *) FMC_Common_R_BASE_NS)
#define SDMMC1_NS                           ((SDMMC_TypeDef *) SDMMC1_BASE_NS)
#define SDMMC2_NS                           ((SDMMC_TypeDef *) SDMMC2_BASE_NS)
#define SDMMC3_NS                           ((SDMMC_TypeDef *) SDMMC3_BASE_NS)
#define ETH1_NS                             ((ETH_TypeDef *) ETH1_BASE_NS)
#define ETH2_NS                             ((ETH_TypeDef *) ETH2_BASE_NS)
#define USBH_OHCI_NS                        ((USBH_OHCI_TypeDef *) USBH_OHCI_BASE_NS)
#define USBH_EHCI_NS                        ((USBH_EHCI_TypeDef *) USBH_EHCI_BASE_NS)
#define USBDR_NS                            ((USB_OTG_GlobalTypeDef *) USBDR_BASE_NS)
#define CA35SYSCFG_NS                       ((CA35SYSCFG_TypeDef *) CA35SYSCFG_BASE_NS)

#define DBGMCU_NS                           ((DBGMCU_TypeDef *) DBGMCU_BASE_NS)
#if defined (CORTEX_IN_SECURE_STATE)
#define TIM2_S                              ((TIM_TypeDef *) TIM2_BASE_S)
#define TIM3_S                              ((TIM_TypeDef *) TIM3_BASE_S)
#define TIM4_S                              ((TIM_TypeDef *) TIM4_BASE_S)
#define TIM5_S                              ((TIM_TypeDef *) TIM5_BASE_S)
#define TIM6_S                              ((TIM_TypeDef *) TIM6_BASE_S)
#define TIM7_S                              ((TIM_TypeDef *) TIM7_BASE_S)
#define TIM12_S                             ((TIM_TypeDef *) TIM12_BASE_S)
#define TIM13_S                             ((TIM_TypeDef *) TIM13_BASE_S)
#define TIM14_S                             ((TIM_TypeDef *) TIM14_BASE_S)
#define LPTIM1_S                            ((LPTIM_TypeDef *) LPTIM1_BASE_S)
#define LPTIM2_S                            ((LPTIM_TypeDef *) LPTIM2_BASE_S)
#define SPI2_S                              ((SPI_TypeDef *) SPI2_BASE_S)
#define SPI3_S                              ((SPI_TypeDef *) SPI3_BASE_S)
#define SPDIFRX_S                           ((SPDIFRX_TypeDef *) SPDIFRX_BASE_S)
#define USART2_S                            ((USART_TypeDef *) USART2_BASE_S)
#define USART3_S                            ((USART_TypeDef *) USART3_BASE_S)
#define UART4_S                             ((USART_TypeDef *) UART4_BASE_S)
#define UART5_S                             ((USART_TypeDef *) UART5_BASE_S)
#define I2C1_S                              ((I2C_TypeDef *) I2C1_BASE_S)
#define I2C2_S                              ((I2C_TypeDef *) I2C2_BASE_S)
#define I2C3_S                              ((I2C_TypeDef *) I2C3_BASE_S)
#define I3C1_S                              ((I3C_TypeDef *) I3C1_BASE_S)
#define I3C2_S                              ((I3C_TypeDef *) I3C2_BASE_S)
#define I3C3_S                              ((I3C_TypeDef *) I3C3_BASE_S)
#define TIM10_S                             ((TIM_TypeDef *) TIM10_BASE_S)
#define TIM11_S                             ((TIM_TypeDef *) TIM11_BASE_S)

#define TIM1_S                              ((TIM_TypeDef *) TIM1_BASE_S)
#define TIM8_S                              ((TIM_TypeDef *) TIM8_BASE_S)
#define USART6_S                            ((USART_TypeDef *) USART6_BASE_S)
#define SPI1_S                              ((SPI_TypeDef *) SPI1_BASE_S)
#define SPI4_S                              ((SPI_TypeDef *) SPI4_BASE_S)
#define TIM15_S                             ((TIM_TypeDef *) TIM15_BASE_S)
#define TIM16_S                             ((TIM_TypeDef *) TIM16_BASE_S)
#define TIM17_S                             ((TIM_TypeDef *) TIM17_BASE_S)
#define SPI5_S                              ((SPI_TypeDef *) SPI5_BASE_S)
#define SAI1_S                              ((SAI_TypeDef *) SAI1_BASE_S)
#define SAI1_Block_A_S                      ((SAI_Block_TypeDef *) SAI1_Block_A_BASE_S)
#define SAI1_Block_B_S                      ((SAI_Block_TypeDef *) SAI1_Block_B_BASE_S)
#define SAI2_S                              ((SAI_TypeDef *) SAI2_BASE_S)
#define SAI2_Block_A_S                      ((SAI_Block_TypeDef *) SAI2_Block_A_BASE_S)
#define SAI2_Block_B_S                      ((SAI_Block_TypeDef *) SAI2_Block_B_BASE_S)
#define SAI3_S                              ((SAI_TypeDef *) SAI3_BASE_S)
#define SAI3_Block_A_S                      ((SAI_Block_TypeDef *) SAI3_Block_A_BASE_S)
#define SAI3_Block_B_S                      ((SAI_Block_TypeDef *) SAI3_Block_B_BASE_S)
#define FDCAN1_S                            ((FDCAN_GlobalTypeDef *) FDCAN1_BASE_S)
#define FDCAN2_S                            ((FDCAN_GlobalTypeDef *) FDCAN2_BASE_S)
#define FDCAN_CCU_S                         ((FDCAN_ClockCalibrationUnit_TypeDef *) CANCU_BASE_S)
#define USART1_S                            ((USART_TypeDef *) USART1_BASE_S)
#define SAI4_S                              ((SAI_TypeDef *) SAI4_BASE_S)
#define SAI4_Block_A_S                      ((SAI_Block_TypeDef *) SAI4_Block_A_BASE_S)
#define SAI4_Block_B_S                      ((SAI_Block_TypeDef *) SAI4_Block_B_BASE_S)
#define UART7_S                             ((USART_TypeDef *) UART7_BASE_S)

#define HPDMA1_S                            ((DMA_TypeDef *) HPDMA1_BASE_S)
#define HPDMA2_S                            ((DMA_TypeDef *) HPDMA2_BASE_S)
#define HPDMA3_S                            ((DMA_TypeDef *) HPDMA3_BASE_S)
#define OCTOSPI1_S                          ((OCTOSPI_TypeDef *) OCTOSPI1_BASE_S)
#define ICACHE_S                            ((ICACHE_TypeDef *) ICACHE_BASE_S)
#define DCACHE_S                            ((DCACHE_TypeDef *) DCACHE_BASE_S)
#define IPCC1_S                             ((IPCC_TypeDef *) IPCC1_BASE_S)
#define IPCC1_C1_S                          ((IPCC_CommonTypeDef *) IPCC1_C1_BASE_S)
#define IPCC1_C2_S                          ((IPCC_CommonTypeDef *) IPCC1_C2_BASE_S)
#define DCMI_S                              ((DCMI_TypeDef *) DCMI_BASE_S)
#define PSSI_S                              ((PSSI_TypeDef *) PSSI_BASE_S)
#define CRC_S                               ((CRC_TypeDef *) CRC_BASE_S)
#define MDF1_S                              ((MDF_TypeDef *) MDF1_BASE_S)
#define MDF1_Filter0_S                      ((MDF_Filter_TypeDef*) MDF1_Filter0_BASE_S)
#define MDF1_Filter1_S                      ((MDF_Filter_TypeDef*) MDF1_Filter1_BASE_S)
#define MDF1_Filter2_S                      ((MDF_Filter_TypeDef*) MDF1_Filter2_BASE_S)
#define MDF1_Filter3_S                      ((MDF_Filter_TypeDef*) MDF1_Filter3_BASE_S)
#define MDF1_Filter4_S                      ((MDF_Filter_TypeDef*) MDF1_Filter4_BASE_S)
#define MDF1_Filter5_S                      ((MDF_Filter_TypeDef*) MDF1_Filter5_BASE_S)
#define MDF1_Filter6_S                      ((MDF_Filter_TypeDef*) MDF1_Filter6_BASE_S)
#define MDF1_Filter7_S                      ((MDF_Filter_TypeDef*) MDF1_Filter7_BASE_S)
#define ADC1_S                              ((ADC_TypeDef *) ADC1_BASE_S)
#define ADC2_S                              ((ADC_TypeDef *) ADC2_BASE_S)
#define ADC1_COMMON_S                       ((ADC_Common_TypeDef *) ADC1_COMMON_BASE_S)
#define ADC2_COMMON_S                       ((ADC_Common_TypeDef *) ADC2_COMMON_BASE_S)

#define HPDMA1_Channel0_S                   ((DMA_Channel_TypeDef *) HPDMA1_Channel0_BASE_S)
#define HPDMA1_Channel1_S                   ((DMA_Channel_TypeDef *) HPDMA1_Channel1_BASE_S)
#define HPDMA1_Channel2_S                   ((DMA_Channel_TypeDef *) HPDMA1_Channel2_BASE_S)
#define HPDMA1_Channel3_S                   ((DMA_Channel_TypeDef *) HPDMA1_Channel3_BASE_S)
#define HPDMA1_Channel4_S                   ((DMA_Channel_TypeDef *) HPDMA1_Channel4_BASE_S)
#define HPDMA1_Channel5_S                   ((DMA_Channel_TypeDef *) HPDMA1_Channel5_BASE_S)
#define HPDMA1_Channel6_S                   ((DMA_Channel_TypeDef *) HPDMA1_Channel6_BASE_S)
#define HPDMA1_Channel7_S                   ((DMA_Channel_TypeDef *) HPDMA1_Channel7_BASE_S)
#define HPDMA1_Channel8_S                   ((DMA_Channel_TypeDef *) HPDMA1_Channel8_BASE_S)
#define HPDMA1_Channel9_S                   ((DMA_Channel_TypeDef *) HPDMA1_Channel9_BASE_S)
#define HPDMA1_Channel10_S                  ((DMA_Channel_TypeDef *) HPDMA1_Channel10_BASE_S)
#define HPDMA1_Channel11_S                  ((DMA_Channel_TypeDef *) HPDMA1_Channel11_BASE_S)
#define HPDMA1_Channel12_S                  ((DMA_Channel_TypeDef *) HPDMA1_Channel12_BASE_S)
#define HPDMA1_Channel13_S                  ((DMA_Channel_TypeDef *) HPDMA1_Channel13_BASE_S)
#define HPDMA1_Channel14_S                  ((DMA_Channel_TypeDef *) HPDMA1_Channel14_BASE_S)
#define HPDMA1_Channel15_S                  ((DMA_Channel_TypeDef *) HPDMA1_Channel15_BASE_S)

