STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp213axx_cm33.h
/***************  Bit definition for ETH_DMAC1RXDLAR register  ****************/
#define ETH_DMAC1RXDLAR_RDESLA_Pos          (0U)
#define ETH_DMAC1RXDLAR_RDESLA_Msk          (0xFFFFFFFFUL << ETH_DMAC1RXDLAR_RDESLA_Pos)         /*!< 0xFFFFFFFF */
#define ETH_DMAC1RXDLAR_RDESLA              ETH_DMAC1RXDLAR_RDESLA_Msk                          /*!< Start of Receive List */

/************  Bit definition for ETH_DMAC1TXDTPR register  ************/
#define ETH_DMAC1TXDTPR_TDT_Pos             (3U)
#define ETH_DMAC1TXDTPR_TDT_Msk             (0x1FFFFFFFUL << ETH_DMAC1TXDTPR_TDT_Pos)            /*!< 0xFFFFFFF8 */
#define ETH_DMAC1TXDTPR_TDT                 ETH_DMAC1TXDTPR_TDT_Msk                             /*!< Transmit Descriptor Tail Pointer */
#define ETH_DMAC1TXDTPR_TDT_0               (0x1UL << ETH_DMAC1TXDTPR_TDT_Pos)                   /*!< 0x00000008 */
#define ETH_DMAC1TXDTPR_TDT_1               (0x2UL << ETH_DMAC1TXDTPR_TDT_Pos)                   /*!< 0x00000010 */
#define ETH_DMAC1TXDTPR_TDT_2               (0x4UL << ETH_DMAC1TXDTPR_TDT_Pos)                   /*!< 0x00000020 */
#define ETH_DMAC1TXDTPR_TDT_3               (0x8UL << ETH_DMAC1TXDTPR_TDT_Pos)                   /*!< 0x00000040 */
#define ETH_DMAC1TXDTPR_TDT_4               (0x10UL << ETH_DMAC1TXDTPR_TDT_Pos)                  /*!< 0x00000080 */
#define ETH_DMAC1TXDTPR_TDT_5               (0x20UL << ETH_DMAC1TXDTPR_TDT_Pos)                  /*!< 0x00000100 */
#define ETH_DMAC1TXDTPR_TDT_6               (0x40UL << ETH_DMAC1TXDTPR_TDT_Pos)                  /*!< 0x00000200 */
#define ETH_DMAC1TXDTPR_TDT_7               (0x80UL << ETH_DMAC1TXDTPR_TDT_Pos)                  /*!< 0x00000400 */
#define ETH_DMAC1TXDTPR_TDT_8               (0x100UL << ETH_DMAC1TXDTPR_TDT_Pos)                 /*!< 0x00000800 */
#define ETH_DMAC1TXDTPR_TDT_9               (0x200UL << ETH_DMAC1TXDTPR_TDT_Pos)                 /*!< 0x00001000 */
#define ETH_DMAC1TXDTPR_TDT_10              (0x400UL << ETH_DMAC1TXDTPR_TDT_Pos)                 /*!< 0x00002000 */
#define ETH_DMAC1TXDTPR_TDT_11              (0x800UL << ETH_DMAC1TXDTPR_TDT_Pos)                 /*!< 0x00004000 */
#define ETH_DMAC1TXDTPR_TDT_12              (0x1000UL << ETH_DMAC1TXDTPR_TDT_Pos)                /*!< 0x00008000 */
#define ETH_DMAC1TXDTPR_TDT_13              (0x2000UL << ETH_DMAC1TXDTPR_TDT_Pos)                /*!< 0x00010000 */
#define ETH_DMAC1TXDTPR_TDT_14              (0x4000UL << ETH_DMAC1TXDTPR_TDT_Pos)                /*!< 0x00020000 */
#define ETH_DMAC1TXDTPR_TDT_15              (0x8000UL << ETH_DMAC1TXDTPR_TDT_Pos)                /*!< 0x00040000 */
#define ETH_DMAC1TXDTPR_TDT_16              (0x10000UL << ETH_DMAC1TXDTPR_TDT_Pos)               /*!< 0x00080000 */
#define ETH_DMAC1TXDTPR_TDT_17              (0x20000UL << ETH_DMAC1TXDTPR_TDT_Pos)               /*!< 0x00100000 */
#define ETH_DMAC1TXDTPR_TDT_18              (0x40000UL << ETH_DMAC1TXDTPR_TDT_Pos)               /*!< 0x00200000 */
#define ETH_DMAC1TXDTPR_TDT_19              (0x80000UL << ETH_DMAC1TXDTPR_TDT_Pos)               /*!< 0x00400000 */
#define ETH_DMAC1TXDTPR_TDT_20              (0x100000UL << ETH_DMAC1TXDTPR_TDT_Pos)              /*!< 0x00800000 */
#define ETH_DMAC1TXDTPR_TDT_21              (0x200000UL << ETH_DMAC1TXDTPR_TDT_Pos)              /*!< 0x01000000 */
#define ETH_DMAC1TXDTPR_TDT_22              (0x400000UL << ETH_DMAC1TXDTPR_TDT_Pos)              /*!< 0x02000000 */
#define ETH_DMAC1TXDTPR_TDT_23              (0x800000UL << ETH_DMAC1TXDTPR_TDT_Pos)              /*!< 0x04000000 */
#define ETH_DMAC1TXDTPR_TDT_24              (0x1000000UL << ETH_DMAC1TXDTPR_TDT_Pos)             /*!< 0x08000000 */
#define ETH_DMAC1TXDTPR_TDT_25              (0x2000000UL << ETH_DMAC1TXDTPR_TDT_Pos)             /*!< 0x10000000 */
#define ETH_DMAC1TXDTPR_TDT_26              (0x4000000UL << ETH_DMAC1TXDTPR_TDT_Pos)             /*!< 0x20000000 */
#define ETH_DMAC1TXDTPR_TDT_27              (0x8000000UL << ETH_DMAC1TXDTPR_TDT_Pos)             /*!< 0x40000000 */
#define ETH_DMAC1TXDTPR_TDT_28              (0x10000000UL << ETH_DMAC1TXDTPR_TDT_Pos)            /*!< 0x80000000 */

/***************  Bit definition for ETH_DMAC1RXDTPR register  ****************/
#define ETH_DMAC1RXDTPR_RDT_Pos             (0U)
#define ETH_DMAC1RXDTPR_RDT_Msk             (0xFFFFFFFFUL << ETH_DMAC1RXDTPR_RDT_Pos)            /*!< 0xFFFFFFFF */
#define ETH_DMAC1RXDTPR_RDT                 ETH_DMAC1RXDTPR_RDT_Msk                             /*!< Receive Descriptor Tail Pointer */

/************  Bit definition for ETH_DMAC1TXRLR register  *************/
#define ETH_DMAC1TXRLR_TDRL_Pos             (0U)
#define ETH_DMAC1TXRLR_TDRL_Msk             (0x3FFUL << ETH_DMAC1TXRLR_TDRL_Pos)                 /*!< 0x000003FF */
#define ETH_DMAC1TXRLR_TDRL                 ETH_DMAC1TXRLR_TDRL_Msk                             /*!< Transmit Descriptor Ring Length */
#define ETH_DMAC1TXRLR_TDRL_0               (0x1UL << ETH_DMAC1TXRLR_TDRL_Pos)                   /*!< 0x00000001 */
#define ETH_DMAC1TXRLR_TDRL_1               (0x2UL << ETH_DMAC1TXRLR_TDRL_Pos)                   /*!< 0x00000002 */
#define ETH_DMAC1TXRLR_TDRL_2               (0x4UL << ETH_DMAC1TXRLR_TDRL_Pos)                   /*!< 0x00000004 */
#define ETH_DMAC1TXRLR_TDRL_3               (0x8UL << ETH_DMAC1TXRLR_TDRL_Pos)                   /*!< 0x00000008 */
#define ETH_DMAC1TXRLR_TDRL_4               (0x10UL << ETH_DMAC1TXRLR_TDRL_Pos)                  /*!< 0x00000010 */
#define ETH_DMAC1TXRLR_TDRL_5               (0x20UL << ETH_DMAC1TXRLR_TDRL_Pos)                  /*!< 0x00000020 */
#define ETH_DMAC1TXRLR_TDRL_6               (0x40UL << ETH_DMAC1TXRLR_TDRL_Pos)                  /*!< 0x00000040 */
#define ETH_DMAC1TXRLR_TDRL_7               (0x80UL << ETH_DMAC1TXRLR_TDRL_Pos)                  /*!< 0x00000080 */
#define ETH_DMAC1TXRLR_TDRL_8               (0x100UL << ETH_DMAC1TXRLR_TDRL_Pos)                 /*!< 0x00000100 */
#define ETH_DMAC1TXRLR_TDRL_9               (0x200UL << ETH_DMAC1TXRLR_TDRL_Pos)                 /*!< 0x00000200 */

